<a href="https://colab.research.google.com/github/melanieshimano/bcpss-enrollment-data/blob/main/2020_11_03_bcpss_enrollment_aggregation_melanieshimano.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Maryland Public School Enrollment, 2019-2020

Here we're going to dive a bit deeper into the Maryland State public schools dataset to see how enrollment had changed from 2019-2020 by different grade levels and types of schools.

# import libraries

In [141]:
# for data analysis
import pandas as pd
import numpy as np

# to help export files
from google.colab import files

# import data

In [142]:
# import data 

#2019 enrollment data
df_19_enroll = pd.read_csv("https://raw.githubusercontent.com/jhu-business-analytics/bcpss-enrollment-data/main/original_data_files/Enrollment_2019.csv")

# 2020 enrollment data
df_20_enroll = pd.read_csv("https://raw.githubusercontent.com/jhu-business-analytics/bcpss-enrollment-data/main/original_data_files/Enrollment_By_Grade_2020.csv")

#2019 attendance data
df_19_attend = pd.read_csv("https://raw.githubusercontent.com/jhu-business-analytics/bcpss-enrollment-data/main/original_data_files/Attendance_2019.csv")

In [143]:
# preview 2019 enrollment
df_19_enroll.head()

   Academic Year LSS Number  ... Enrolled Count Create Date
0           2019         01  ...             13    20190903
1           2019         01  ...             31    20190903
2           2019         01  ...             36    20190903
3           2019         01  ...             28    20190903
4           2019         01  ...             40    20190903

[5 rows x 8 columns]

In [144]:
# preview the information type
df_19_enroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9781 entries, 0 to 9780
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Academic Year   9781 non-null   int64
 1   LSS Number      9781 non-null   object
 2   LSS Name        9781 non-null   object
 3   School Number   9781 non-null   object
 4   School Name     9781 non-null   object
 5   Grade           9781 non-null   object
 6   Enrolled Count  9781 non-null   object
 7   Create Date     9781 non-null   int64
dtypes: int64(2), object(6)
memory usage: 611.4+ KB

In [145]:
# look at the number of unique values in School Number
df_19_enroll["School Number"].nunique()

830

In [146]:
# look at the num of unique school names
df_19_enroll["School Name"].nunique()

1395

# Create Unique ID for each school

In [147]:
# create unique id by adding lss number and school number
df_19_enroll["school_id"] = df_19_enroll["LSS Number"] +  df_19_enroll["School Number"]

In [148]:
# preview new col
df_19_enroll.head(10)

   Academic Year LSS Number  LSS Name  ... Enrolled Count Create Date school_id
0           2019         01  Allegany  ...             13    20190903    010301
1           2019         01  Allegany  ...             31    20190903    010301
2           2019         01  Allegany  ...             36    20190903    010301
3           2019         01  Allegany  ...             28    20190903    010301
4           2019         01  Allegany  ...             40    20190903    010301
5           2019         01  Allegany  ...             38    20190903    010301
6           2019         01  Allegany  ...             40    20190903    010301
7           2019         01  Allegany  ...            226    20190903    010301
8           2019         01  Allegany  ...             76    20190903    010401
9           2019         01  Allegany  ...             93    20190903    010401

[10 rows x 9 columns]

In [149]:
# preview 2020 data
df_20_enroll.head()

   Year LSS  LSS Name  ...                  Grade Enrolled Count Create Date
0  2020  01  Allegany  ...  Prekindergarten Age 4             19    20200805
1  2020  01  Allegany  ...           Kindergarten             28    20200805
2  2020  01  Allegany  ...                Grade 1             31    20200805
3  2020  01  Allegany  ...                Grade 2             40    20200805
4  2020  01  Allegany  ...                Grade 3             30    20200805

[5 rows x 8 columns]

In [150]:
# create unique identifier for 2020 enrollment data
df_20_enroll["school_id"] = df_20_enroll["LSS"] +  df_20_enroll["School"]

In [151]:
# preview 2020 data
df_20_enroll.head(10)

   Year LSS  LSS Name  ... Enrolled Count Create Date school_id
0  2020  01  Allegany  ...             19    20200805    010301
1  2020  01  Allegany  ...             28    20200805    010301
2  2020  01  Allegany  ...             31    20200805    010301
3  2020  01  Allegany  ...             40    20200805    010301
4  2020  01  Allegany  ...             30    20200805    010301
5  2020  01  Allegany  ...             38    20200805    010301
6  2020  01  Allegany  ...             35    20200805    010301
7  2020  01  Allegany  ...            221    20200805    010301
8  2020  01  Allegany  ...             97    20200805    010401
9  2020  01  Allegany  ...             63    20200805    010401

[10 rows x 9 columns]

# Merge 2019 and 2020 data

## Renaming the column values

In [152]:
# nested numpy where statement to change pre k and all grades
#df_20_enroll["Grade"] = np.where(df_20_enroll["Grade"] == "Prekindergarten Age 4", "Prekindergarten", (np.where(df_20_enroll["Grade"] == "All Grades", "Total Enrollment", df_20_enroll["Grade"])))

In [153]:
# preview data
df_20_enroll.head(10)

   Year LSS  LSS Name  ... Enrolled Count Create Date school_id
0  2020  01  Allegany  ...             19    20200805    010301
1  2020  01  Allegany  ...             28    20200805    010301
2  2020  01  Allegany  ...             31    20200805    010301
3  2020  01  Allegany  ...             40    20200805    010301
4  2020  01  Allegany  ...             30    20200805    010301
5  2020  01  Allegany  ...             38    20200805    010301
6  2020  01  Allegany  ...             35    20200805    010301
7  2020  01  Allegany  ...            221    20200805    010301
8  2020  01  Allegany  ...             97    20200805    010401
9  2020  01  Allegany  ...             63    20200805    010401

[10 rows x 9 columns]

In [154]:
# change prek age 4 to just pre k
df_20_enroll["Grade"] = np.where(df_20_enroll["Grade"] == "Prekindergarten Age 4", "Prekindergarten", df_20_enroll["Grade"])

In [155]:
# preview data
df_20_enroll.head(10)

   Year LSS  LSS Name  ... Enrolled Count Create Date school_id
0  2020  01  Allegany  ...             19    20200805    010301
1  2020  01  Allegany  ...             28    20200805    010301
2  2020  01  Allegany  ...             31    20200805    010301
3  2020  01  Allegany  ...             40    20200805    010301
4  2020  01  Allegany  ...             30    20200805    010301
5  2020  01  Allegany  ...             38    20200805    010301
6  2020  01  Allegany  ...             35    20200805    010301
7  2020  01  Allegany  ...            221    20200805    010301
8  2020  01  Allegany  ...             97    20200805    010401
9  2020  01  Allegany  ...             63    20200805    010401

[10 rows x 9 columns]

In [156]:
# change "all grades" to "total enrollment"
df_20_enroll["Grade"] = np.where(df_20_enroll["Grade"] == "All Grades", "Total Enrollment", df_20_enroll["Grade"])

## Merging datasets together

In [157]:
# merge with pandas

df_19_20_merge  = pd.merge(df_19_enroll, 
                           df_20_enroll[["school_id", "Grade", "Enrolled Count"]],
                           on = ["school_id", "Grade"],
                           how = "left")

In [158]:
# preview merged data
df_19_20_merge.head()

   Academic Year LSS Number  LSS Name  ... Create Date school_id Enrolled Count_y
0           2019         01  Allegany  ...    20190903    010301               19
1           2019         01  Allegany  ...    20190903    010301               28
2           2019         01  Allegany  ...    20190903    010301               31
3           2019         01  Allegany  ...    20190903    010301               40
4           2019         01  Allegany  ...    20190903    010301               30

[5 rows x 10 columns]

In [159]:
# rename columns for 2019 and 2020
df_19_20_merge = df_19_20_merge.rename(columns = {"Enrolled Count_x": "Enrolled Count 2019", 
                                                  "Enrolled Count_y": "Enrolled Count 2020"})

# Calculate Percent change in enrollment in 2020

In [160]:
# remove any values are *
df_19_20_merge = df_19_20_merge[df_19_20_merge["Enrolled Count 2019"] != "*"]

In [161]:
# convert enrolled count to integers
df_19_20_merge["Enrolled Count 2019"] = df_19_20_merge["Enrolled Count 2019"].astype(int)

In [162]:
# preview integer df
df_19_20_merge.head()

   Academic Year LSS Number  ... school_id Enrolled Count 2020
0           2019         01  ...    010301                  19
1           2019         01  ...    010301                  28
2           2019         01  ...    010301                  31
3           2019         01  ...    010301                  40
4           2019         01  ...    010301                  30

[5 rows x 10 columns]

In [163]:
df_19_20_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9437 entries, 0 to 9780
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Academic Year        9437 non-null   int64
 1   LSS Number           9437 non-null   object
 2   LSS Name             9437 non-null   object
 3   School Number        9437 non-null   object
 4   School Name          9437 non-null   object
 5   Grade                9437 non-null   object
 6   Enrolled Count 2019  9437 non-null   int64
 7   Create Date          9437 non-null   int64
 8   school_id            9437 non-null   object
 9   Enrolled Count 2020  9194 non-null   object
dtypes: int64(3), object(7)
memory usage: 811.0+ KB

In [164]:
# remove any values are * from 2020 column
df_19_20_merge = df_19_20_merge[df_19_20_merge["Enrolled Count 2020"] != "*"]

In [165]:
# convert enrolled count to integers
df_19_20_merge["Enrolled Count 2020"] = df_19_20_merge["Enrolled Count 2020"].astype(float)

In [166]:
# preview df
df_19_20_merge.head()

   Academic Year LSS Number  ... school_id Enrolled Count 2020
0           2019         01  ...    010301                19.0
1           2019         01  ...    010301                28.0
2           2019         01  ...    010301                31.0
3           2019         01  ...    010301                40.0
4           2019         01  ...    010301                30.0

[5 rows x 10 columns]

In [167]:
# deleting the create date column
del df_19_20_merge["Create Date"]

In [168]:
# getting  alist of the column names
df_19_20_merge.columns.to_list()

['Academic Year',
 'LSS Number',
 'LSS Name',
 'School Number',
 'School Name',
 'Grade',
 'Enrolled Count 2019',
 'school_id',
 'Enrolled Count 2020']

In [169]:
#rearrange the column in df
df_19_20_merge = df_19_20_merge[['school_id',
                                 'Academic Year',
                                 'LSS Number',
                                 'LSS Name',
                                 'School Number',
                                 'School Name',
                                 'Grade',
                                 'Enrolled Count 2019',
                                 'Enrolled Count 2020']]

In [170]:
# preview data
df_19_20_merge.head()

  school_id  Academic Year  ... Enrolled Count 2019 Enrolled Count 2020
0    010301           2019  ...                  13                19.0
1    010301           2019  ...                  31                28.0
2    010301           2019  ...                  36                31.0
3    010301           2019  ...                  28                40.0
4    010301           2019  ...                  40                30.0

[5 rows x 9 columns]

In [171]:
# create a new unique identifier column
df_19_20_merge["grade_school_id"] = df_19_20_merge["Grade"] + df_19_20_merge["School Name"]

In [172]:
# create a new df for just enrollment numbers
df_enroll_pctchange = df_19_20_merge[["grade_school_id",
                                      "Enrolled Count 2019", 
                                      "Enrolled Count 2020"]]

In [173]:
# preview df
df_enroll_pctchange.head()

                        grade_school_id  ...  Enrolled Count 2020
0  PrekindergartenFlintstone Elementary  ...                 19.0
1     KindergartenFlintstone Elementary  ...                 28.0
2          Grade 1Flintstone Elementary  ...                 31.0
3          Grade 2Flintstone Elementary  ...                 40.0
4          Grade 3Flintstone Elementary  ...                 30.0

[5 rows x 3 columns]

In [174]:
# move the unique id to the row label
df_enroll_pctchange = df_enroll_pctchange.set_index("grade_school_id")

In [175]:
# use percent change to make a new column that is the percent change
df_enroll_pctchange["pct_change"] = df_enroll_pctchange.pct_change(axis = "columns")["Enrolled Count 2020"]

In [176]:
# preview pct change
df_enroll_pctchange.head()

                                      Enrolled Count 2019  ...  pct_change
grade_school_id                                            ...
PrekindergartenFlintstone Elementary                   13  ...    0.461538
KindergartenFlintstone Elementary                      31  ...   -0.096774
Grade 1Flintstone Elementary                           36  ...   -0.138889
Grade 2Flintstone Elementary                           28  ...    0.428571
Grade 3Flintstone Elementary                           40  ...   -0.250000

[5 rows x 3 columns]

In [177]:
# reset index
df_enroll_pctchange = df_enroll_pctchange.reset_index()

In [178]:
# preview data
df_enroll_pctchange.head()

                        grade_school_id  ...  pct_change
0  PrekindergartenFlintstone Elementary  ...    0.461538
1     KindergartenFlintstone Elementary  ...   -0.096774
2          Grade 1Flintstone Elementary  ...   -0.138889
3          Grade 2Flintstone Elementary  ...    0.428571
4          Grade 3Flintstone Elementary  ...   -0.250000

[5 rows x 4 columns]

## merge percent change values back to original merged data

In [179]:
# merge pct change back to original dataframe
df_19_20_merge = pd.merge(df_19_20_merge,
                          df_enroll_pctchange[["grade_school_id", "pct_change"]], 
                          how = "left", 
                          on = "grade_school_id")

In [180]:
# preview data
df_19_20_merge.head()

  school_id  Academic Year  ...                       grade_school_id pct_change
0    010301           2019  ...  PrekindergartenFlintstone Elementary   0.461538
1    010301           2019  ...  PrekindergartenFlintstone Elementary   0.052632
2    010301           2019  ...     KindergartenFlintstone Elementary  -0.096774
3    010301           2019  ...     KindergartenFlintstone Elementary   0.045455
4    010301           2019  ...          Grade 1Flintstone Elementary  -0.138889

[5 rows x 11 columns]

In [87]:
# rearrange df to have numbers together
df_19_20_merge = df_19_20_merge[[ 'school_id',
                                "grade_school_id",
                                'Academic Year',
 'LSS Number',
 'LSS Name',
 'School Number',
 'School Name',
 'Grade',
 'Enrolled Count 2019',
 'Enrolled Count 2020',
 "pct_change"]]

## export data as csv

In [181]:
# export merged data as a csv
df_19_20_merge.to_csv("2019_2020_md_school_enrollment.csv", index = False)

In [182]:
#download the csv in computer downloads file
files.download("2019_2020_md_school_enrollment.csv")

# Merge School Type onto df

In [183]:
# attendance data
df_19_attend.head()

   Academic Year LSS Number  ... Chronic Absentee Pct Create Date
0           2019         01  ...                 10.5    20200117
1           2019         01  ...                 27.3    20200117
2           2019         01  ...                 24.6    20200117
3           2019         01  ...                 31.5    20200117
4           2019         01  ...                 28.5    20200117

[5 rows x 18 columns]

In [184]:
# make school id column
df_19_attend["school_id"] = df_19_attend["LSS Number"] + df_19_attend["School Number"]

In [185]:
# merge school type onto merged dataset
df_19_20_merge = pd.merge(df_19_20_merge, 
                          df_19_attend[["school_id", "School Type"]],
                          how = "left",
                          on = "school_id")

In [187]:
df_19_20_merge.head()

  school_id  Academic Year  ... pct_change School Type
0    010301           2019  ...   0.461538  Elementary
1    010301           2019  ...   0.052632  Elementary
2    010301           2019  ...  -0.096774  Elementary
3    010301           2019  ...   0.045455  Elementary
4    010301           2019  ...  -0.138889  Elementary

[5 rows x 12 columns]

In [188]:
# drop duplicates based on grade schoool id
df_19_20_merge = df_19_20_merge.drop_duplicates(subset = "grade_school_id", keep = "first")

In [189]:
# preview data
df_19_20_merge.head(10)

   school_id  Academic Year  ... pct_change School Type
0     010301           2019  ...   0.461538  Elementary
2     010301           2019  ...  -0.096774  Elementary
4     010301           2019  ...  -0.138889  Elementary
6     010301           2019  ...   0.428571  Elementary
8     010301           2019  ...  -0.250000  Elementary
10    010301           2019  ...   0.000000  Elementary
12    010301           2019  ...  -0.125000  Elementary
14    010301           2019  ...  -0.022124  Elementary
16    010401           2019  ...   0.276316  Elementary
17    010401           2019  ...  -0.322581  Elementary

[10 rows x 12 columns]

In [192]:
# export this as a csv with the school type
df_19_20_merge.to_csv("2019_2020_md_school_enrollment_type.csv", index = False)

In [193]:
# export the file
files.download("2019_2020_md_school_enrollment_type.csv")

## pivot table with school type

In [196]:
# pivot table to see average enrolled count 2019, 2020 and average pct change
df_pivot_enroll = pd.pivot_table(df_19_20_merge,
                                 index = "School Type",
                                 values = ["Enrolled Count 2019", "Enrolled Count 2020", "pct_change"],
                                 aggfunc = np.mean).reset_index()

In [199]:
#preview data
df_pivot_enroll.head(10)

  School Type  Enrolled Count 2019  ...  pct_change  avg_pct_change
0  Elementary           626.619846  ...    0.023271       -0.376135
1        High           496.024606  ...    0.027578        0.026444
2      Middle           352.743415  ...    0.028310        0.039508

[3 rows x 5 columns]

In [198]:
# add in percent change of averages
df_pivot_enroll["avg_pct_change"] = -1*((df_pivot_enroll["Enrolled Count 2019"] - df_pivot_enroll["Enrolled Count 2020"])/df_pivot_enroll["Enrolled Count 2019"])

# Aggregate by Groupby

## Aggregate in a new, condensed dataframe

In [201]:
# preview data
df_19_20_merge.head(10)

   school_id  Academic Year  ... pct_change School Type
0     010301           2019  ...   0.461538  Elementary
2     010301           2019  ...  -0.096774  Elementary
4     010301           2019  ...  -0.138889  Elementary
6     010301           2019  ...   0.428571  Elementary
8     010301           2019  ...  -0.250000  Elementary
10    010301           2019  ...   0.000000  Elementary
12    010301           2019  ...  -0.125000  Elementary
14    010301           2019  ...  -0.022124  Elementary
16    010401           2019  ...   0.276316  Elementary
17    010401           2019  ...  -0.322581  Elementary

[10 rows x 12 columns]

In [206]:
# make an aggregated table grouped by district name and grade level
df_agg_district_grade = df_19_20_merge.groupby(["LSS Name", "Grade"])["Enrolled Count 2019", "Enrolled Count 2020", "pct_change"].agg(["mean"]).reset_index()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

In [208]:
# preview data
df_agg_district_grade.tail(10)

      LSS Name             Grade  ... Enrolled Count 2020 pct_change
                                  ...                mean       mean
438  Worcester           Grade 5  ...          169.333333   0.042335
439  Worcester           Grade 6  ...          168.000000   0.063291
440  Worcester           Grade 7  ...           75.000000  -0.002038
441  Worcester           Grade 8  ...           79.000000  -0.070673
442  Worcester           Grade 9  ...          181.000000   0.096277
443  Worcester       High School  ...                 NaN   0.000000
444  Worcester      Kindergarten  ...           94.000000   0.086783
445  Worcester     Middle School  ...                 NaN   0.000000
446  Worcester   Prekindergarten  ...           86.200000   0.067908
447  Worcester  Total Enrollment  ...         1006.000000   0.011003

[10 rows x 5 columns]

## Additive aggregation calculations

In [213]:
# new df that removes all public schools
df_merge = df_19_20_merge[df_19_20_merge["LSS Name"] != "All Public Schools"]

In [218]:
# new df that removes SEED schools
df_merge = df_merge[df_19_20_merge["LSS Name"] != "SEED"]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [227]:
# new df that removes school number A
df_merge = df_merge[df_19_20_merge["School Number"] != "A"]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [219]:
# check values in the merged dataframe
df_merge["LSS Name"].unique()

array(['Allegany', 'Anne Arundel', 'Baltimore County', 'Calvert',
       'Caroline', 'Carroll', 'Cecil', 'Charles', 'Dorchester',
       'Frederick', 'Garrett', 'Harford', 'Howard', 'Kent', 'Montgomery',
       "Prince George's", "Queen Anne's", "Saint Mary's", 'Somerset',
       'Talbot', 'Washington', 'Wicomico', 'Worcester', 'Baltimore City'],
      dtype=object)

In [228]:
# add a new column in df that is the average enrolled count 2019 of a grade
df_merge["avg_grade_count_2019"] = df_merge.groupby("Grade")["Enrolled Count 2019"].transform("mean")

In [229]:
# preview df
df_merge.tail(10)

      school_id  Academic Year  ... School Type avg_grade_count_2019
12856    300454           2019  ...        High           245.958159
12857    300454           2019  ...        High           647.964784
12858    300480           2019  ...        High           317.057269
12859    300480           2019  ...        High           295.648889
12860    300480           2019  ...        High           269.532751
12861    300480           2019  ...        High           245.958159
12862    300480           2019  ...        High           647.964784
12863    300884           2019  ...        High           317.057269
12864    300884           2019  ...        High           295.648889
12865    300884           2019  ...        High           647.964784

[10 rows x 13 columns]